# Conductor Size Properties

Source: https://www.revitapidocs.com/2026/59d39fc9-ba30-f373-7a3c-6b297cef1651.htm

---

| Conductor Size Properties |
| --- |

The ConductorSize type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | Diameter | The diameter of the conductor. |
|  | Id | The Conductor Size id. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The Conductor Size name. |

Top See Also

#### Reference

ConductorSize Class Autodesk.Revit.DB.Electrical Namespace